{
    "navbar":{
        "home":"Inicio",
        "profile":"Perfil",
        "skills":"Conocimientos",
        "projects":"Proyectos",
        "works":"Trabajos",
        "contact":"Contacto"
    },

    "home":{
        "card-title":"Desarrollador Full Stack",
        "card-button":"Descargar CV",
        "about-title":"¡Hola mundo!",
        "about-sub-title-01":"Soy Franklin",
        "about-sub-title-02":"Desarrollador Full Stack",
        "about-description":"Ayudo a que las empresas crezcan mediante la creación de increíbles soluciones de software. Si buscas un desarrollador orientado a generar soluciones de calidad.",
        "about-button":"Contáctame"
    },

    "profile":{
        "profile-title":"Sobre mí",
        "profile-description-01":"Mi nombre es Franklin Castro, soy desarrollador de software, apasionado por el arte de hacer código.",
        "profile-description-02":"Me especializo en tecnologías como: HTML, CSS, Javascript y Bootstrap. Estas habilidades me permiten crear interfaces de usuario visualmente atractivas y responsivas que mejoran la experiencia general del usuario.",
        "profile-description-03":"Estoy orientado a generar soluciones a través de la comunicación, la innovación y la invención tecnológica. Comprometido con el desarrollo humano a través del progreso tecnológico ético."
    },

    "skills":{
        "skills-title":"CONOCIMIENTOS",
        "skills-sub-title":"Soy un apasionado por el conocimiento y aprendizaje continuo",
        "skills-stack-01":"Front-end",
        "skills-stack-02":"Back-end",
        "skills-stack-03":"Bases de datos",
        "skills-stack-04":"Otros"
    },    
    
    "projects":{
        "projects-title":"PROYECTOS",
        "projects-sub-title":"Estos son algunos de los proyectos en los que he trabajado",

        "project-01-title":"Cenfotec Kingdoms",
        "project-01-sub-title-01":"2023",
        "project-01-sub-title-02":"Videojuego de estrategia",
        "project-01-sub-title-03":"Tecnologías",
        "project-01-description":"Videojuego desarrollado utilizando Java como parte del Curso de Patrones de Programación de la Universidad Cenfotec.",
        "project-01-big-description-01":"El videojuego basado en Java, desarrollado como parte del Curso de Patrones de Programación de la Universidad Cenfotec, es un testimonio de su sólido diseño e implementación. Al demostrar competencia en varios patrones de programación, como Singleton, Factory, Observer y Strategy, entre otros, el juego muestra un dominio de la arquitectura de sistemas complejos dentro de Java.",
        "project-01-big-description-02":"El juego sirve como un ejemplo práctico de desarrollo de software, destacando la aplicación de programación orientada a objetos y patrones de diseño en un proyecto del mundo real. El éxito de este proyecto indica una sólida comprensión de los principios y mejores prácticas del diseño de software.",

        "project-02-title":"MobyDyg",
        "project-02-sub-title-01":"2022",
        "project-02-sub-title-02":"Comercio Electrónico",
        "project-02-sub-title-03":"Tecnologías",
        "project-02-description":"Plataforma de comercio diseñada con tecnologías de vanguardia, incluidas MySQL, AWS, Angular, TypeScript y NodeJS.",
        "project-02-big-description-01":"La plataforma E-Commerce es una solución integral de compras online que integra varias tecnologías de vanguardia. Utiliza MySQL para una gestión de datos eficiente, AWS para una infraestructura de nube confiable y escalable y Angular con TypeScript para una interfaz de usuario dinámica y receptiva.",
        "project-02-big-description-02":"El backend de la plataforma de comercio electrónico aprovecha AWS Lambda con NodeJS, mejorando su escalabilidad y reduciendo los gastos operativos. AWS API Gateway complementa esta configuración, proporcionando una capa API segura y administrada para una comunicación fluida entre los componentes frontend y backend. Juntas, estas tecnologías garantizan un manejo eficiente y rentable de los procesos backend, contribuyendo al rendimiento y la confiabilidad generales de la plataforma.",

        "project-03-title":"3Pillar Global Costa Rica",
        "project-03-sub-title-01":"2021",
        "project-03-sub-title-02":"Plataforma de Torneos",
        "project-03-sub-title-03":"Tecnologías",
        "project-03-description":"Plataforma web de la Federación Costarricense de Taekwondo para la gestión de torneos, construida con tecnologías como: React, Javascript, C#, ASP.NET MVC y Microsoft SQL Server.",
        "project-03-big-description-01":"La plataforma web desarrollada para la Federación Costarricense de Taekwondo para la gestión de torneos es una solución integral construida con una moderna tecnología. Utilizando React para el frontend, JavaScript para el comportamiento dinámico, C# para la funcionalidad backend con ASP.NET MVC y Microsoft SQL Server para la gestión de bases de datos, la plataforma ofrece un sistema sólido y eficiente para gestionar torneos.",
        "project-03-big-description-02":"Esta plataforma agiliza los procesos de organización de torneos, brindando a los administradores herramientas para la programación, la gestión de participantes y el seguimiento de resultados. Su uso de tecnologías contemporáneas garantiza una experiencia receptiva y fácil de usar para todas las partes interesadas involucradas en los torneos de taekwondo."
    },

    "works":{
        "works-title":"TRABAJOS",
        "works-sub-title":"Si quieres saber más sobre mí, pongámonos en contacto",
        "works-description-01":"Estas son algunas de mis principales redes sociales, donde podrás encontrar más información sobre mí y mi trabajo.",
        "works-description-02":"Siempre estoy abierto a nuevas oportunidades y desafíos.",
        "linkedin":"Descubre más sobre mí en LinkedIn",
        "github":"Encuentra mis proyectos en GitHub",
        "whatsapp":"Hablemos sobre tu proyecto por WhatsApp"
    },

    "contact":{
        "contact-title":"CONTACTO",
        "contact-sub-title":"Siempre estoy abierto a nuevas oportunidades",
        "contact-description":"Hablemos de tu proyecto y transformemos tu idea en un negocio real.",
        "form-name":"Ingresa tu nombre",
        "form-email":"Ingresa tu correo",
        "form-message":"Cuéntame sobre tu proyecto",
        "form-button":"Enviar"
    },

    "footer":{
        "footer-title":"Desarrollador Full Stack - Franklin Castro"
    }
}